hey.log

Summary:
  Total:	2.0044 secs
  Slowest:	0.0370 secs
  Fastest:	0.0001 secs
  Average:	0.0018 secs
  Requests/sec:	1021.7675
  
  Total data:	321536 bytes
  Size/request:	157 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [2014]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [1]	|
  0.011 [0]	|
  0.015 [0]	|
  0.019 [0]	|
  0.022 [0]	|
  0.026 [0]	|
  0.030 [0]	|
  0.033 [0]	|
  0.037 [32]	|■


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0008 secs
  50% in 0.0012 secs
  75% in 0.0015 secs
  90% in 0.0020 secs
  95% in 0.0023 secs
  99% in 0.0362 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:	0.0016 secs, 0.0001 secs, 0.0350 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0010 secs

Status code distribution:
  [400]	1 responses
  [405]	2047 responses