hey.log

Summary:
  Total:	1.0525 secs
  Slowest:	0.0771 secs
  Fastest:	0.0077 secs
  Average:	0.0467 secs
  Requests/sec:	243.2231
  
  Total data:	40192 bytes
  Size/request:	157 bytes

Response time histogram:
  0.008 [1]	|■
  0.015 [8]	|■■■■■■
  0.022 [23]	|■■■■■■■■■■■■■■■■■■
  0.028 [4]	|■■■
  0.035 [11]	|■■■■■■■■■
  0.042 [47]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.049 [50]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.056 [40]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.063 [14]	|■■■■■■■■■■■
  0.070 [42]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.077 [16]	|■■■■■■■■■■■■■


Latency distribution:
  10% in 0.0166 secs
  25% in 0.0373 secs
  50% in 0.0464 secs
  75% in 0.0608 secs
  90% in 0.0689 secs
  95% in 0.0740 secs
  99% in 0.0769 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0012 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0465 secs, 0.0076 secs, 0.0770 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [400]	5 responses
  [405]	251 responses