hey.log

Summary:
  Total:	1.0483 secs
  Slowest:	0.0814 secs
  Fastest:	0.0310 secs
  Average:	0.0481 secs
  Requests/sec:	244.2017
  
  Total data:	40192 bytes
  Size/request:	157 bytes

Response time histogram:
  0.031 [1]	|
  0.036 [12]	|■■■■■
  0.041 [48]	|■■■■■■■■■■■■■■■■■■■■
  0.046 [94]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.051 [29]	|■■■■■■■■■■■■
  0.056 [35]	|■■■■■■■■■■■■■■■
  0.061 [6]	|■■■
  0.066 [2]	|■
  0.071 [4]	|■■
  0.076 [14]	|■■■■■■
  0.081 [11]	|■■■■■


Latency distribution:
  10% in 0.0377 secs
  25% in 0.0413 secs
  50% in 0.0450 secs
  75% in 0.0522 secs
  90% in 0.0714 secs
  95% in 0.0758 secs
  99% in 0.0810 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0000 secs, 0.0069 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0042 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0026 secs
  resp wait:	0.0474 secs, 0.0309 secs, 0.0759 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [400]	8 responses
  [405]	248 responses