hey.log

Summary:
  Total:	5.0076 secs
  Slowest:	0.0361 secs
  Fastest:	0.0004 secs
  Average:	0.0022 secs
  Requests/sec:	1597.5874
  
  Total data:	1256000 bytes
  Size/request:	157 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [7946]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [13]	|
  0.011 [0]	|
  0.015 [0]	|
  0.018 [0]	|
  0.022 [0]	|
  0.025 [0]	|
  0.029 [0]	|
  0.032 [22]	|
  0.036 [18]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0016 secs
  50% in 0.0021 secs
  75% in 0.0026 secs
  90% in 0.0029 secs
  95% in 0.0031 secs
  99% in 0.0034 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0015 secs
  resp wait:	0.0021 secs, 0.0003 secs, 0.0320 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [400]	23 responses
  [405]	7977 responses