hey.log

Summary:
  Total:	2.0058 secs
  Slowest:	0.0372 secs
  Fastest:	0.0003 secs
  Average:	0.0020 secs
  Requests/sec:	2028.0774
  
  Total data:	638676 bytes
  Size/request:	157 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [4031]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [4]	|
  0.011 [0]	|
  0.015 [0]	|
  0.019 [0]	|
  0.022 [0]	|
  0.026 [0]	|
  0.030 [4]	|
  0.034 [15]	|
  0.037 [13]	|


Latency distribution:
  10% in 0.0009 secs
  25% in 0.0012 secs
  50% in 0.0017 secs
  75% in 0.0022 secs
  90% in 0.0026 secs
  95% in 0.0028 secs
  99% in 0.0034 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0031 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:	0.0019 secs, 0.0003 secs, 0.0328 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [400]	1 responses
  [405]	4067 responses