hey.log

Summary:
  Total:	1.0188 secs
  Slowest:	0.0367 secs
  Fastest:	0.0071 secs
  Average:	0.0158 secs
  Requests/sec:	251.2754
  
  Total data:	40192 bytes
  Size/request:	157 bytes

Response time histogram:
  0.007 [1]	|
  0.010 [34]	|■■■■■■■■■■
  0.013 [45]	|■■■■■■■■■■■■■
  0.016 [134]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [10]	|■■■
  0.022 [0]	|
  0.025 [0]	|
  0.028 [0]	|
  0.031 [0]	|
  0.034 [13]	|■■■■
  0.037 [19]	|■■■■■■


Latency distribution:
  10% in 0.0097 secs
  25% in 0.0116 secs
  50% in 0.0145 secs
  75% in 0.0154 secs
  90% in 0.0317 secs
  95% in 0.0348 secs
  99% in 0.0367 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0021 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0014 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0155 secs, 0.0070 secs, 0.0353 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [400]	1 responses
  [405]	255 responses