hey.log

Summary:
  Total:	1.0149 secs
  Slowest:	0.0864 secs
  Fastest:	0.0074 secs
  Average:	0.0269 secs
  Requests/sec:	252.2311
  
  Total data:	40192 bytes
  Size/request:	157 bytes

Response time histogram:
  0.007 [1]	|
  0.015 [135]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [24]	|■■■■■■■
  0.031 [12]	|■■■■
  0.039 [27]	|■■■■■■■■
  0.047 [10]	|■■■
  0.055 [17]	|■■■■■
  0.063 [7]	|■■
  0.071 [5]	|■
  0.079 [3]	|■
  0.086 [15]	|■■■■


Latency distribution:
  10% in 0.0100 secs
  25% in 0.0115 secs
  50% in 0.0149 secs
  75% in 0.0356 secs
  90% in 0.0621 secs
  95% in 0.0816 secs
  99% in 0.0861 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0000 secs, 0.0019 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0012 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0266 secs, 0.0074 secs, 0.0864 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [400]	12 responses
  [405]	244 responses