hey.log

Summary:
  Total:	1.1039 secs
  Slowest:	0.1066 secs
  Fastest:	0.0114 secs
  Average:	0.0650 secs
  Requests/sec:	231.9026
  
  Total data:	40192 bytes
  Size/request:	157 bytes

Response time histogram:
  0.011 [1]	|■
  0.021 [26]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.030 [16]	|■■■■■■■■■■■■■■
  0.040 [15]	|■■■■■■■■■■■■■
  0.049 [10]	|■■■■■■■■■
  0.059 [14]	|■■■■■■■■■■■■
  0.069 [34]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.078 [45]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [31]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.097 [46]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.107 [18]	|■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 0.0204 secs
  25% in 0.0484 secs
  50% in 0.0706 secs
  75% in 0.0876 secs
  90% in 0.0942 secs
  95% in 0.1017 secs
  99% in 0.1066 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0000 secs, 0.0025 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0009 secs
  resp wait:	0.0646 secs, 0.0113 secs, 0.1065 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [400]	26 responses
  [405]	230 responses