hey.log

Summary:
  Total:	1.1220 secs
  Slowest:	0.4143 secs
  Fastest:	0.0258 secs
  Average:	0.1152 secs
  Requests/sec:	208.5579
  
  Total data:	31714 bytes
  Size/request:	157 bytes

Response time histogram:
  0.026 [1]	|
  0.065 [86]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.103 [34]	|■■■■■■■■■■■■■■■■
  0.142 [33]	|■■■■■■■■■■■■■■■
  0.181 [10]	|■■■■■
  0.220 [7]	|■■■
  0.259 [10]	|■■■■■
  0.298 [5]	|■■
  0.337 [7]	|■■■
  0.375 [8]	|■■■■
  0.414 [1]	|


Latency distribution:
  10% in 0.0417 secs
  25% in 0.0479 secs
  50% in 0.0789 secs
  75% in 0.1338 secs
  90% in 0.2896 secs
  95% in 0.3344 secs
  99% in 0.3695 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0010 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0007 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.1150 secs, 0.0257 secs, 0.4134 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [405]	202 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused


Summary:
  Total:	1.1050 secs
  Slowest:	0.3297 secs
  Fastest:	0.0224 secs
  Average:	0.1133 secs
  Requests/sec:	205.4339
  
  Total data:	30615 bytes
  Size/request:	157 bytes

Response time histogram:
  0.022 [1]	|■
  0.053 [52]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.084 [55]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.115 [23]	|■■■■■■■■■■■■■■■■■
  0.145 [15]	|■■■■■■■■■■■
  0.176 [5]	|■■■■
  0.207 [12]	|■■■■■■■■■
  0.238 [0]	|
  0.268 [18]	|■■■■■■■■■■■■■
  0.299 [6]	|■■■■
  0.330 [8]	|■■■■■■


Latency distribution:
  10% in 0.0431 secs
  25% in 0.0487 secs
  50% in 0.0774 secs
  75% in 0.1671 secs
  90% in 0.2658 secs
  95% in 0.2745 secs
  99% in 0.3297 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0000 secs, 0.0017 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.1130 secs, 0.0223 secs, 0.3281 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [405]	195 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused


Summary:
  Total:	1.1369 secs
  Slowest:	0.4318 secs
  Fastest:	0.0269 secs
  Average:	0.1321 secs
  Requests/sec:	189.9837
  
  Total data:	28888 bytes
  Size/request:	157 bytes

Response time histogram:
  0.027 [1]	|■
  0.067 [74]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.108 [28]	|■■■■■■■■■■■■■■■
  0.148 [33]	|■■■■■■■■■■■■■■■■■■
  0.189 [11]	|■■■■■■
  0.229 [5]	|■■■
  0.270 [0]	|
  0.310 [4]	|■■
  0.351 [13]	|■■■■■■■
  0.391 [11]	|■■■■■■
  0.432 [4]	|■■


Latency distribution:
  10% in 0.0377 secs
  25% in 0.0471 secs
  50% in 0.1062 secs
  75% in 0.1623 secs
  90% in 0.3428 secs
  95% in 0.3713 secs
  99% in 0.4318 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0000 secs, 0.0017 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.1318 secs, 0.0269 secs, 0.4301 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [405]	184 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused


Summary:
  Total:	1.0536 secs
  Slowest:	0.2891 secs
  Fastest:	0.0245 secs
  Average:	0.1003 secs
  Requests/sec:	221.1479
  
  Total data:	31557 bytes
  Size/request:	157 bytes

Response time histogram:
  0.024 [1]	|■
  0.051 [72]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.077 [31]	|■■■■■■■■■■■■■■■■■
  0.104 [1]	|■
  0.130 [38]	|■■■■■■■■■■■■■■■■■■■■■
  0.157 [22]	|■■■■■■■■■■■■
  0.183 [16]	|■■■■■■■■■
  0.210 [4]	|■■
  0.236 [4]	|■■
  0.263 [9]	|■■■■■
  0.289 [3]	|■■


Latency distribution:
  10% in 0.0412 secs
  25% in 0.0464 secs
  50% in 0.0759 secs
  75% in 0.1406 secs
  90% in 0.1836 secs
  95% in 0.2444 secs
  99% in 0.2787 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0011 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.1002 secs, 0.0244 secs, 0.2878 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [405]	201 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused