hey.log

Summary:
  Total:	1.0390 secs
  Slowest:	0.2635 secs
  Fastest:	0.0206 secs
  Average:	0.1044 secs
  Requests/sec:	213.6704
  
  Total data:	29830 bytes
  Size/request:	157 bytes

Response time histogram:
  0.021 [1]	|■
  0.045 [60]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [27]	|■■■■■■■■■■■■■■■■■■
  0.093 [5]	|■■■
  0.118 [1]	|■
  0.142 [32]	|■■■■■■■■■■■■■■■■■■■■■
  0.166 [24]	|■■■■■■■■■■■■■■■■
  0.191 [19]	|■■■■■■■■■■■■■
  0.215 [14]	|■■■■■■■■■
  0.239 [5]	|■■■
  0.263 [2]	|■


Latency distribution:
  10% in 0.0280 secs
  25% in 0.0421 secs
  50% in 0.1291 secs
  75% in 0.1612 secs
  90% in 0.1976 secs
  95% in 0.2066 secs
  99% in 0.2635 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0000 secs, 0.0021 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0014 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.1039 secs, 0.0206 secs, 0.2612 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [400]	20 responses
  [405]	170 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused